In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [3]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [4]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [5]:
#Deliverable 1: Get a Summary DataFrame

In [6]:

city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [10]:
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
urban_cities_df.head()

                 city       date   fare        ride_id  driver_count   type
0  Lake Jonathanshire 2019-01-14  13.83  5739410935873             5  Urban
1  South Michelleport 2019-03-04  30.24  2343912425577            72  Urban
2  Port Samanthamouth 2019-02-24  33.44  2005065760003            57  Urban
3          Rodneyfort 2019-02-10  23.44  5149245426178            34  Urban
4          South Jack 2019-03-06  34.58  3908451377344            46  Urban

In [ ]:
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
suburban_cities_df

In [ ]:
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]
rural_cities_df

In [ ]:
#  1. Get the total rides for each city type

urban_ride_count = urban_cities_df.groupby(["type"]).count()["ride_id"]
urban_ride_count

In [ ]:
suburban_ride_count = suburban_cities_df.groupby(["type"]).count()["ride_id"]
suburban_ride_count

In [ ]:
rural_ride_count = rural_cities_df.groupby(["type"]).count()["ride_id"]
rural_ride_count

In [ ]:
# 2. Get the total drivers for each city type
urban_driver_count = urban_cities_df.groupby(["type"]).sum()["driver_count"]
urban_driver_count

In [ ]:
suburban_driver_count = suburban_cities_df.groupby(["type"]).sum()["driver_count"]
suburban_driver_count

In [ ]:
rural_driver_count = rural_cities_df.groupby(["type"]).sum()["driver_count"]
rural_driver_count

In [ ]:
#  3. Get the total amount of fares for each city type
suburban_total_fare = suburban_cities_df.groupby(["type"]).sum()["fare"]
suburban_total_fare

In [ ]:
urban_total_fare = urban_cities_df.groupby(["type"]).sum()["fare"]
urban_total_fare

In [ ]:
rural_total_fare = rural_cities_df.groupby(["type"]).sum()["fare"]
rural_total_fare

In [ ]:
#  4. Get the average fare per ride for each city type. 
urban_avg_ride_fare = urban_cities_df.groupby(["type"]).mean()["fare"]
urban_avg_ride_fare

In [ ]:
suburban_avg_ride_fare = suburban_cities_df.groupby(["type"]).mean()["fare"]
suburban_avg_ride_fare

In [ ]:
rural_avg_ride_fare = rural_cities_df.groupby(["type"]).mean()["fare"]
rural_avg_ride_fare

In [ ]:
# 5. Get the average fare per driver for each city type. 
urban_avg_driver_fare = urban_cities_df.groupby(["type"]).mean()["driver_count"]
urban_avg_driver_fare

In [ ]:
suburban_avg_driver_fare = suburban_cities_df.groupby(["type"]).mean()["driver_count"]
suburban_avg_driver_fare

In [ ]:
rural_avg_driver_fare = rural_cities_df.groupby(["type"]).mean()["driver_count"]
rural_avg_driver_fare

In [ ]:
#  6. Create a PyBer summary DataFrame. 
pd.options.display.float_format = '${:,.2f}'.format
pyber_summary_df = pd.DataFrame ({
    "Type": ["Urban", "Suburban", "Rural"],
    "Total Rides": [1625, 625, 125],
    "Total Drivers":[59602, 8570, 537], 
    "Total Fares":[39854.38, 19356.33, 4327.93],
    "Average Fare per Ride":[24.525772, 30.970128, 34.62344], 
    "Average Fare per Driver":[36.678154, 13.712, 4.296],
})
                                
pyber_summary_df

In [ ]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
pyber_summary_df

In [ ]:
city_data_df.isnull().sum()

In [ ]:
#Deliverable 2. Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [9]:
# 1. Read the merged DataFrame
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df['date'] = pyber_data_df['date'].astype('datetime64[ns]').dt.normalize()
pyber_data_df.head()

                 city       date   fare        ride_id  driver_count   type
0  Lake Jonathanshire 2019-01-14  13.83  5739410935873             5  Urban
1  South Michelleport 2019-03-04  30.24  2343912425577            72  Urban
2  Port Samanthamouth 2019-02-24  33.44  2005065760003            57  Urban
3          Rodneyfort 2019-02-10  23.44  5149245426178            34  Urban
4          South Jack 2019-03-06  34.58  3908451377344            46  Urban

In [164]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
sum_of_fares = pyber_data_df.groupby(["city", "date"]).sum()["fare"]
sum_of_fares.head()

city         date
Amandaburgh  2019-01-02 09:57:04   $33.06
             2019-01-11 02:22:07   $29.24
             2019-01-13 16:04:10   $23.35
             2019-01-21 04:12:54    $9.26
             2019-01-29 23:28:12   $41.06
Name: fare, dtype: float64

In [8]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df['date'] = pyber_data_df['date'].astype('datetime64[ns]').dt.normalize()
pyber_data_df = pyber_data_df.reset_index()
table = pd.pivot_table(pyber_data_df, values=['fare'], index=['date'],
                    columns=['type'])
table

                 fare
type            Rural   Suburban      Urban
date
2019-01-01  43.690000  32.130000  18.254286
2019-01-02  52.120000  39.274286  25.499167
2019-01-03  19.900000  26.696000  21.706667
2019-01-04  24.880000  20.690000  23.467273
2019-01-05        NaN  33.786667  29.817059
...               ...        ...        ...
2019-05-04        NaN  30.570000  24.890000
2019-05-05  26.530000  22.111429  23.007143
2019-05-06  37.293333  34.120000  30.200000
2019-05-07  44.940000  27.409000  21.500833
2019-05-08        NaN        NaN  24.402857

[128 rows x 3 columns]

In [174]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'
given_dates = table.df["2019-01-01 00:08:16"]
print("Using Loc: " + given_dates )

AttributeError: 'DataFrame' object has no attribute 'df'

In [ ]:
berry_phone = df.loc["Berry", "Phone Number"]
print("Using Loc: " + berry_phone)

also_berry_phone = df.iloc[1, 2]
print("Using Iloc: " + also_berry_phone)